app/controllers/graphs_controller.rb

  def show
    @graph = Graph.find(params[:id])
---
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 1)

  def edit
    @graph = Graph.find(params[:id])
---
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 2)

  def create
    @graph = Graph.new(params[:graph])
    @graph.user = current_user

    respond_to do |format|
      if @graph.save
---
INSERT INTO `graphs` (`name`, `created_at`, `updated_at`, `user_id`) VALUES('asdf', '2008-12-09 09:09:18', '2008-12-09 09:09:18', NULL)

  def update
    @graph = Graph.find(params[:id])

    respond_to do |format|
      if @graph.update_attributes(params[:graph])
---
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 1)
UPDATE `graphs` SET `updated_at` = '2008-12-06 10:07:09', `name` = 'Blaablaajoo345' WHERE `id` = 3

  def destroy
    @graph = Graph.find(params[:id])
    @graph.destroy
---
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 2)
DELETE FROM `graphs` WHERE `id` = 2

  def render_notes_xml
    sync_from_db()

    # Works nicely, except excludes article content
    #xmlnotes = @graphnotes.to_xml
    #render :xml => xmlnotes

    # Includes article content, but adds weird extra tags(?!)
    #@xml = Builder::XmlMarkup.new
    #@xml.instruct! :xml
    #@xml.notes{
    #  for note in @graphnotes
    #    @xml.note do
    #      @xml.id(note.id)
    #      @xml.name(note.name)
    #      @xml.content((RedCloth.new note.article.content).to_html)
    #      #etc...
    #    end
    #  end
    #}
    #render :xml => @xml

    # ... So we use REXML :(
    xml = REXML::Document.new
    xml.add_element("notes")
    @graphnotes.each do |n|
      tmp = REXML::Element.new("note")
      ["id","name","x","y","width","height","color","content"].each do |s|
        tmp.add_element(s)
      end
      # Again unflexible code
      tmp.elements["id"].text = n.id
      tmp.elements["name"].text = n.name
      tmp.elements["x"].text = n.x
      tmp.elements["y"].text = n.y
      tmp.elements["width"].text = n.width
      tmp.elements["height"].text = n.height
      tmp.elements["color"].text = n.color
      tmp.elements["content"].text = (RedCloth.new n.article.content).to_html
      xml.root.elements << tmp
    end
    render :xml => xml

  end
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
SELECT * FROM `notes` WHERE (`notes`.graph_id = 8)