app/controllers/notes_controller.rb

  def show
    @note = Note.find(params[:id])

    respond_to do |format|
      format.html # show.html.erb
      # format.xml  { render :xml => @note } #default
      format.xml {
        xml = REXML::Document.new
        xml.add_element("notes")
        tmp = REXML::Element.new("note")
        ["id","name","x","y","width","height","color","content","editableContent"].each do |s|
          tmp.add_element(s)
        end
        # Again unflexible code
        tmp.elements["id"].text = @note.id
        tmp.elements["name"].text = @note.name
        tmp.elements["x"].text = @note.x
        tmp.elements["y"].text = @note.y
        tmp.elements["width"].text = @note.width
        tmp.elements["height"].text = @note.height
        tmp.elements["color"].text = @note.color
        tmp.elements["content"].text = RedCloth.new(white_list(@note.article.content),[:filter_styles]).to_html(:textile, :youtube)
        tmp.elements["editableContent"].text = @note.article.content

        # Related edges: (TODO: combine these loops please)

        # incoming
        @note.edges_to.each do |e|
---
SELECT * FROM `notes` WHERE (`notes`.`id` = 1)
SELECT * FROM `articles` WHERE (`articles`.note_id = 1) LIMIT 1

  def edit
    @note = Note.find(params[:id])
---
SELECT * FROM `notes` WHERE (`notes`.`id` = 6)

  def create
    # This makes all new notes have the same article...
    #@article = Article.find_or_create_by_content(params[:article_content])
    @article = Article.create(:content => params[:article_content])
    @article.content_type = 1 # Lame, yeah.
    @graph = Graph.find(params[:graph_id])
    @note = Note.new(params[:note])
    @note.article = @article
    @note.graph = @graph

    @note.save
---
INSERT INTO `articles` (`created_at`, `updated_at`, `content`) VALUES('2008-12-10 14:15:40', '2008-12-10 14:15:40', 'joo: [[media type=\"youtube\" key=\"guDxHFA1OzE\" height=\"100\" width=\"200\"]]')
SELECT * FROM `articles` WHERE (`articles`.`content` = 'joo: [[media type=\"youtube\" key=\"guDxHFA1OzE\" height=\"100\" width=\"200\"]]') LIMIT 1
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 1)
INSERT INTO `notes` (`name`, `graph_id`, `created_at`, `x`, `y`, `updated_at`, `color`, `article_id`, `height`, `width`) VALUES('nooooote', 4, '2008-12-09 09:12:41', 10, 10, '2008-12-09 09:12:41', '#abba10', 1, 10, 10)

  def destroy
    @graph = Graph.find(params[:graph_id])

    @note = Note.find(params[:id])

    @note.edges_to.each do |e|
      e.destroy
---
SELECT * FROM `graphs` WHERE (`graphs`.`id` = 1)
SELECT * FROM `notes` WHERE (`notes`.`id` = 5)
SELECT * FROM `edges` WHERE (`edges`.target_id = 3)
DELETE FROM `edges` WHERE `id` = 714276562
DELETE FROM `notes` WHERE `id` = 5